# =============================================
# TCP/IP 서버 예제
# =============================================
# 클라이언트의 접속을 기다리며, 클라이언트가 보낸 메세지를 수신하고
# 간단한 응답을 보내는 기능

import socket # 네트워크 통신을 위한 기본 모듈

#------------------------------------
# 1. 서버 기본 설정
#------------------------------------
HOST = '192.168.0.174'  # 서버의 ip 주소
PORT = 9998             # 사용할 포트 번호 (0~65535 중 하나, 다른 서비와 중복되지 않게 주의)

#------------------------------------
# 2. 소켓 객체 생성
#------------------------------------
# socket.AF_INET : IPv4 주소 체계
# socket.SOCK_STREAM : TCP 프로토콜 사용
server_socket = socket.socket(socket.AF_INET, socket.SOCK_STREAM)

#------------------------------------
# 3. IP와 포트를 소켓에 바인딩(연결)
#------------------------------------
server_socket.bind((HOST, PORT))   # 서버가 클라이언트 요청을 받을 수 있도록 설정

#------------------------------------
# 4. 클라이언트 연결 대기 시작
#------------------------------------
# Listen 호출 시, 기본적으로 동시 접속 1개만 허용
server_socket.listen()
print(f"서버가 {HOST}:{PORT}에서 연결 대기 중입니다....")

#------------------------------------
# 5. 클라이언트 연결 수락(accept)
#------------------------------------
# 클라이언트가 접속할 때까지 블로킹 상태로 대기
# 연결이 발생하면 (클라이언트 소켓, 클라이언트 주소) 튜플 형태로 반환
client_socket, addr = server_socket.accept()
print(f"클라이언트 {addr} 연결 완료")

#------------------------------------
# 6. 클라이언트와 메세지 송수신 루프
#------------------------------------
while True:
    # 클라이언트로부터 최대 1024 바이트 데이터 수신
    data = client_socket.recv(1024).decode()        # 클라이언트로부터의 메세지 bytes --> str 변환
    if not data:
        # 클라이언트 연결이 끊기면 루프 종료
        print("데이터 수신 종료 (클라이언트 연결 해제됨)")
        break

    # 종료 명령 감지
    if data.lower() == "exit":
        print("데이터 수신 종료 (클라이언트 연결 해제됨)")
        break

    # 수신된 메세지 출력
    print(f"클라이언트 메세지 : {data}")

    # 서버의 응답 생성
    reply = f"서버 응답: [{data}] 잘 받았습니다."

    # 클라이언트로 응답 전송 (문자열 --> bytes 변환)
    client_socket.sendall(reply.encode())


#------------------------------------
# 7. 연결 종료
#------------------------------------
client_socket.close()
server_socket.close()
print("서버 종료 완료")





