#===================================================
# - 이미지 파일을 읽어와서 ai 서버로 전송
# - ai 서버가 반환한 분류 결과를 출력
#===================================================

import socket     # tcp/ip 통신을 위한 라이브러리
import struct     # 정수 -> byte로 변환
import json       # json 처리

# =============================================
# 서버 접속 정보
# =============================================
HOST = '192.168.0.174'  # 서버의 ip 주소
PORT = 9998

# =============================================
# 지정 크기만큼 데이터 수신하는 함수
# =============================================
def recv_all(sock, size):
    data = b''
    while len(data) < size:
        packet = sock.recv(size - len(data))

        if not packet:
            return None

        data += packet

    return data

# =============================================
# 이미지 읽어오기
# =============================================
print("이미지 읽기 시작")

# 전송할 이미지 파일
IMAGE_PATH = "./horse.jpg"

with open(IMAGE_PATH, "rb") as f:
    image_data = f.read()

print("이미지 읽기 완료")
print("이미지 크기 : ", len(image_data), "byte")

# =============================================
# 소켓 생성
# =============================================
client_socket = socket.socket(socket.AF_INET, socket.SOCK_STREAM)
print("소켓 생성 완료")

# =============================================
# 서버 접속
# =============================================
print("서버 접속 시도")
client_socket.connect((HOST, PORT))
print("서버 접속 성공")

# =============================================
# 이미지 크기 전송
# =============================================
image_size = len(image_data)
print("전송 이미지 크기 : ", image_size)

client_socket.sendall(struct.pack(">I", image_size))
print("이미지 크기 전송 완료")

# =============================================
# 이미지 데이터 전송
# =============================================
client_socket.sendall(image_data)
print("이미지 전송 완료")

# =============================================
# 결과 길이 수신
# =============================================
header = recv_all(client_socket, 4)
result_size = struct.unpack(">I", header)[0]

print("결과 크기 : ", result_size)

# =============================================
# 결과 데이터 수신
# =============================================
result_bytes = recv_all(client_socket, result_size)
print("결과 데이터 수신 완료")

# =============================================
# encode data > json > python dictionary
# =============================================
result = json.loads(
    result_bytes.decode()
)
print("json 변환 완료")

# =============================================
# 결과 출력
# =============================================
print("\n")

print("=========================================")
print("AI 분류 결과")
print("=========================================")

print("Class ID : ", result["class_id"])
print("Class Name : ", result["class_name"])
print("Confidence : ", round(result["confidence"], 4))

print("=========================================")

# =============================================
# 연결 종료
# =============================================
client_socket.close()
print("서버 연결 종료")






